<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [
    // 生成应用公共文件>>
//    '__file__' => ['common.php', 'config.php', 'database.php'],//一般注释掉,即使注释掉,也会生成"common.php,和config.php"
    //生成模块文件>>
    'admin'     => [  //模块名字
//        '__file__'   => ['common.php'],  //生成一个文件,一般注释掉
        '__dir__'    => ['controller', 'view'],  //生成路径,一定要和下面的一一对应
        //---------------------------------------------------
        'controller' => ['Admin','Index'],
        'view'       => ['admin/Admin','index/index'],
        //----------------------------------------------------
    ],
    //    在项目文件里打开黑框 然后  php think build --config build.php
    //  注意,如果不成功,可能是有 build.lock文件,删除此文件即可
];
